testScripts/gatling/request-bodies/Ping_ok.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:add="http://www.w3.org/2005/08/addressing" xmlns:urn="urn:riv:itinfra:tp:PingResponder:1">
   <soapenv:Header>
      <add:To>ping</add:To>
   </soapenv:Header>
   <soapenv:Body>
      <urn:ping>
         <urn:pingIn></urn:pingIn>
         <!--You may enter ANY elements at this point-->
      </urn:ping>
   </soapenv:Body>
</soapenv:Envelope>